<?php

$a=5;
$b=10;


/* เพิ่มค่า*/ 
echo "ค่าเริ่มต้น = ".$a."<br>"; // 5
echo "เพิ่มค่าแบบ prefix = ".(++$a)."<br>";
echo "ค่าล่าสุดของ a = ".$a;

echo "<hr>";
$a=5;
echo "ค่าเริ่มต้น = ".$a."<br>"; // 5
echo "เพิ่มค่าแบบ postfix = ".($a++)."<br>";
echo "ค่าล่าสุดของ a = ".$a;

echo "<hr>";

/* ลดค่า*/ 
echo "ค่าเริ่มต้น = ".$b."<br>"; // 10
echo "ลดค่าแบบ prefix = ".(--$b)."<br>";
echo "ค่าล่าสุดของ b = ".$b;

echo "<hr>";
$b=10;
echo "ค่าเริ่มต้น = ".$b."<br>"; // 10
echo "ลดค่าแบบ postfix = ".($b--)."<br>";
echo "ค่าล่าสุดของ b = ".$b;
?>